# Indexing & Selection & Filtering in Pandas

Hi Guys, Welcome to [Tirendaz Academy](https://youtube.com/c/tirendazacademy) üòÄ
</br>
In this notebook, I'm going to talk about indexing & selection & filtering .
</br>
Happy Learning üê±‚Äçüèç

In [1]:
import pandas as pd
import numpy as np

In [2]:
obj=pd.Series(np.arange(5),
              index=["a","b","c","d","e"])

In [11]:
obj

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [3]:
obj["c"]

2

In [4]:
obj[2]

/tmp/ipykernel_27055/1027971403.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[2]

2

In [5]:
obj[0:3]

a    0
b    1
c    2
dtype: int64

In [7]:
obj[["a","c"]]

a    0
b    1
c    2
dtype: int64

In [40]:
obj[[0,2]]

/tmp/ipykernel_10259/3441315538.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[[0,2]]

a    0
c    2
dtype: int64

In [41]:
obj[obj<2]

a    0
b    1
dtype: int64

In [42]:
obj["a":"c"]

a    0
b    1
c    2
dtype: int64

In [43]:
obj["b":"c"]=5
obj

a    0
b    5
c    5
d    3
e    4
dtype: int64

## DataFrame Indexing

In [44]:
data=pd.DataFrame(
    np.arange(16).reshape(4,4),
    index=["London","Paris",
           "Berlin","Istanbul"],
    columns=["one","two","three","four"])
data

          one  two  three  four
London      0    1      2     3
Paris       4    5      6     7
Berlin      8    9     10    11
Istanbul   12   13     14    15

In [45]:
dat=pd.DataFrame(np.arange(16).reshape(4,4),index=['I','J','K','L'], columns=['one','two','three','four'])
dat
dat[["one","three"]]

   one  three
I    0      2
J    4      6
K    8     10
L   12     14

In [46]:
data["two"]

London       1
Paris        5
Berlin       9
Istanbul    13
Name: two, dtype: int64

In [47]:
data[["one","two"]]

          one  two
London      0    1
Paris       4    5
Berlin      8    9
Istanbul   12   13

In [51]:
data[:3]

        one  two  three  four
London    0    1      2     3
Paris     4    5      6     7
Berlin    8    9     10    11

In [52]:
data[data["four"]>5]

          one  two  three  four
Paris       4    5      6     7
Berlin      8    9     10    11
Istanbul   12   13     14    15

In [69]:
data[data<5]=0
data

   one  two  three  four
I    0    0      0     0
J    0    0      6     7
K    8    9     10    11
L   12   13     14    15

## Selecting with iloc and loc

In [82]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Berlin, dtype: int64

In [83]:
data.iloc[1,[1,2,3]]

two      5
three    6
four     7
Name: Paris, dtype: int64

In [87]:
data.iloc[[1,3],[1,2,3]]

          two  three  four
Paris       5      6     7
Istanbul   13     14    15

In [88]:
data.loc["Paris",["one","two"]]

one    0
two    5
Name: Paris, dtype: int64

In [22]:
data.loc[:"Paris","four"]

London    0
Paris     7
Name: four, dtype: int32

In [91]:
toy_data=pd.Series(np.arange(5),
                   index=["a","b","c",
                          "d","e"])
toy_data

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [90]:
toy_data[-1]

/tmp/ipykernel_10259/3728369251.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  toy_data[-1]

4

Don't forget to follow us on [YouTube](http://youtube.com/tirendazacademy) | [Medium](http://tirendazacademy.medium.com) | [Twitter](http://twitter.com/tirendazacademy) | [GitHub](http://github.com/tirendazacademy) | [Linkedin](https://www.linkedin.com/in/tirendaz-academy) | [Kaggle](https://www.kaggle.com/tirendazacademy) üòé